app/Http/Controllers/GenreController.php

    public function index(){
        $genres = Genre::all();
---
select * from "genres"