app/Http/Controllers/MovieController.php

       public function index()
    {
        $movies = Movie::paginate(4);
        $topRatedMovies = Movie::orderByDesc('rating')->take(8)->get();
        $genre = Genre::findOrFail(4);
        $genres = Genre::all();
        $tvSeries = $genre->movies()->take(4)->get();
---
select * from "movies" limit 4
select * from "movies" order by "rating" desc limit 8
select * from "genres" where "genres"."id" = 4 limit 1
select * from "movies" where "movies"."genre_id" = 4 and "movies"."genre_id" is not null limit 4

    public function search()
    {
        $query = Movie::paginate(4);
        $topRatedMovies = Movie::orderByDesc('rating')->take(8)->get();
        $genre = Genre::findOrFail(4);
        $genres = Genre::all();
        $tvSeries = $genre->movies()->take(4)->get();
---
select * from "genres" where "genres"."id" = 4 limit 1
select * from "movies" where "movies"."genre_id" = 4 and "movies"."genre_id" is not null limit 4

     public function show(string $slug)
     {
         $movie = Movie::where('slug', $slug)->firstOrFail();
---
select * from "movies" where "slug" = 'doctor-strange-in-the-multiverse-of-madness' limit 1