app/Http/Controllers/SchemaController.php

select count(*) as aggregate from "seats"
---
    public function show(string $id)
    {
        $ns = Seat::count();