app/Http/Controllers/SchemaController.php

     public function show(string $id)
     {
         $schema = Schema::findOrFail($id);
         $seatsPerRow = $schema->seats_per_row;
         $seats = Seat::where('schema_id', $schema->id)->get();
---
select * from "schemas" where "schemas"."id" = '2' limit 1
select * from "seats" where "schema_id" = 2